note/drawio/converted/dot/260506-top-module-block-diagram.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_NSqoYb7kwDBbw9KJm_ng_1" [label="node_m_ng-1"];
  "n_NSqoYb7kwDBbw9KJm_ng_2" [label="node_m_ng-2"];
  "n_XCGefnzt3Sx8slRFdQB6_1" [label="Stopwatch, Watch Module"];
  "n_XCGefnzt3Sx8slRFdQB6_22" [label="FND"];
  "n_XCGefnzt3Sx8slRFdQB6_26" [label="sw[1:0]"];
  "n_XCGefnzt3Sx8slRFdQB6_4" [label="SR04_Controller"];
  "n_XCGefnzt3Sx8slRFdQB6_5" [label="DHT11_HUMID_TEMP"];
  "n_XCGefnzt3Sx8slRFdQB6_7" [label="node_dQB6-7"];
  "n_sgKVDU6i_RNd5s9dl7Hf_1" [label="node_l7Hf-1"];
  "n_yRs9L5DDgcKWez_suBbv_109" [label="ASCII_Decoder"];
  "n_yRs9L5DDgcKWez_suBbv_11" [label="baud_tick_gen"];
  "n_yRs9L5DDgcKWez_suBbv_115" [label="8"];
  "n_yRs9L5DDgcKWez_suBbv_116" [label="8"];
  "n_yRs9L5DDgcKWez_suBbv_12" [label="node_Bbv-12"];
  "n_yRs9L5DDgcKWez_suBbv_124" [label="r || R"];
  "n_yRs9L5DDgcKWez_suBbv_127" [label="l || L"];
  "n_yRs9L5DDgcKWez_suBbv_128" [label="u || U"];
  "n_yRs9L5DDgcKWez_suBbv_129" [label="d || D"];
  "n_yRs9L5DDgcKWez_suBbv_13" [label="rst"];
  "n_yRs9L5DDgcKWez_suBbv_130" [label="m || M"];
  "n_yRs9L5DDgcKWez_suBbv_133" [label="Control_unit"];
  "n_yRs9L5DDgcKWez_suBbv_139" [label="s || S"];
  "n_yRs9L5DDgcKWez_suBbv_140" [label="FPGA_Btn"];
  "n_yRs9L5DDgcKWez_suBbv_141" [label="Btn_R"];
  "n_yRs9L5DDgcKWez_suBbv_142" [label="Btn_L"];
  "n_yRs9L5DDgcKWez_suBbv_143" [label="Btn_U"];
  "n_yRs9L5DDgcKWez_suBbv_144" [label="Btn_D"];
  "n_yRs9L5DDgcKWez_suBbv_148" [label="node_bv-148"];
  "n_yRs9L5DDgcKWez_suBbv_149" [label="8"];
  "n_yRs9L5DDgcKWez_suBbv_150" [label="node_bv-150"];
  "n_yRs9L5DDgcKWez_suBbv_151" [label="rst"];
  "n_yRs9L5DDgcKWez_suBbv_152" [label="8"];
  "n_yRs9L5DDgcKWez_suBbv_153" [label="Rx- done"];
  "n_yRs9L5DDgcKWez_suBbv_154" [label="pop_data"];
  "n_yRs9L5DDgcKWez_suBbv_155" [label="pop"];
  "n_yRs9L5DDgcKWez_suBbv_156" [label="empty"];
  "n_yRs9L5DDgcKWez_suBbv_157" [label="push_data"];
  "n_yRs9L5DDgcKWez_suBbv_158" [label="push"];
  "n_yRs9L5DDgcKWez_suBbv_159" [label="full"];
  "n_yRs9L5DDgcKWez_suBbv_16" [label="UART_Tx"];
  "n_yRs9L5DDgcKWez_suBbv_17" [label="tx_data"];
  "n_yRs9L5DDgcKWez_suBbv_19" [label="tx_start"];
  "n_yRs9L5DDgcKWez_suBbv_2" [label="PC"];
  "n_yRs9L5DDgcKWez_suBbv_21" [label="tx_busy"];
  "n_yRs9L5DDgcKWez_suBbv_3" [label="Tx"];
  "n_yRs9L5DDgcKWez_suBbv_36" [label="Rx"];
  "n_yRs9L5DDgcKWez_suBbv_4" [label="Rx"];
  "n_yRs9L5DDgcKWez_suBbv_5" [label="UART Rx"];
  "n_yRs9L5DDgcKWez_suBbv_51" [label="node_Bbv-51"];
  "n_yRs9L5DDgcKWez_suBbv_56" [label="baud_tick"];
  "n_yRs9L5DDgcKWez_suBbv_58" [label="baud_tick"];
  "n_yRs9L5DDgcKWez_suBbv_7" [label="Rx data"];
  "n_yRs9L5DDgcKWez_suBbv_72" [label="FIFO Tx"];
  "n_yRs9L5DDgcKWez_suBbv_8" [label="Rx- done"];
  "n_yRs9L5DDgcKWez_suBbv_84" [label="FIFO Rx"];
  "n_yRs9L5DDgcKWez_suBbv_86" [label="pop_data"];
  "n_yRs9L5DDgcKWez_suBbv_88" [label="pop"];
  "n_yRs9L5DDgcKWez_suBbv_9" [label="rst"];
  "n_yRs9L5DDgcKWez_suBbv_90" [label="empty"];
  "n_yRs9L5DDgcKWez_suBbv_91" [label="push_data"];
  "n_yRs9L5DDgcKWez_suBbv_93" [label="push"];
  "n_yRs9L5DDgcKWez_suBbv_95" [label="full"];
  "n_yRs9L5DDgcKWez_suBbv_99" [label="ASCII_sender"];
  "n_yRs9L5DDgcKWez_suBbv_11" -> "n_yRs9L5DDgcKWez_suBbv_5";
  "n_yRs9L5DDgcKWez_suBbv_16" -> "n_yRs9L5DDgcKWez_suBbv_4";
  "n_yRs9L5DDgcKWez_suBbv_148" -> "n_yRs9L5DDgcKWez_suBbv_16";
  "n_sgKVDU6i_RNd5s9dl7Hf_1" -> "n_yRs9L5DDgcKWez_suBbv_124";
  "n_yRs9L5DDgcKWez_suBbv_141" -> "n_sgKVDU6i_RNd5s9dl7Hf_1";
}
